GitConverter/src/Catalogs/ОчередиВыполнения/ОчередиВыполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОчередиВыполнения</name>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоОпераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксНачалаНомераВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксОкончанияНомераВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеРасписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

GitConverter/src/Enums/ОперацииОчереди/ОперацииОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииОчереди</name>
  <enumValues>
    <name>ВыгрузкаВXML</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаВEDT</name>
  </enumValues>
</mdclass:Enum>

GitConverter/src/Catalogs/ХранилищаКонфигураций/ХранилищаКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищаКонфигураций</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформыХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформыВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузкиВерсий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияВGit</name>
    <type>
      <types>CatalogRef.ВерсииХранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛокальныйКаталогGit</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьВременныеДанныеВерсииПослеКоммита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРепозиторияGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСервераGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСервераGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьКоммиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоПодготавливаемыхВерсий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоМетаданных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьВсеОчереди</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИспользованиеОбщихОчередей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоммитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПомещатьАнонимноЕслиНеНайденПользователь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПроектаEDT</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьКонфигурацииПоставщиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертироватьВФорматEDT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьМеткиСВерсиейКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияEDT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьЛогирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХранилища</name>
    <type>
      <types>EnumRef.ТипыХранилищаКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйПроект</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПроектаEDT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяCLI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияEDTCLI</name>
    <type>
      <types>CatalogRef.ВерсииEDT</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогДляАрхивацииОшибок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьКоммитыВРепозиторийGit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозниклаОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеРасписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

GitConverter/src/Catalogs/ОчередиВыполнения/Forms/НастойкаОбщихОчередей/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ИзмененияРегламентныхЗаданийИдентификаторЗадания.Видимость = Истина;
	Элементы.ИзмененияРегламентныхЗаданийПрименитьИзменения.Видимость = Ложь;
	// Значения "по умолчанию"
	КоличествоОчередейXML = 2;
	КоличествоОчередейEDT = 2;
	ЧастотаЗапусков = 15;
	ВремяНачала = '00010101010000';
	ВремяЗавершения = '00010101235959';
	Понедельник = Истина;
	Вторник = Истина;
	Среда = Истина;
	Четверг = Истина;
	Пятница = Истина;
	Суббота = Истина;
	Воскресенье = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЧастотаЗапусковРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЧастотаЗапусков = Цел(ЧастотаЗапусков / 5 + Направление) * 5;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИзмененияРегламентныхЗаданий

&НаКлиенте
Процедура ИзмененияРегламентныхЗаданийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеСтроки = Элементы.ИзмененияРегламентныхЗаданий.ДанныеСтроки(ВыбраннаяСтрока);
	Если ДанныеСтроки <> Неопределено И ЗначениеЗаполнено(ДанныеСтроки.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("Ключ", ДанныеСтроки.Ссылка);
		ОткрытьФорму("Справочник.ОчередиВыполнения.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьИзменения(Команда)
	ЗаполнитьИзмененияНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзменения(Команда)
	ЗаполнитьИзмененияНаСервере(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьИзмененияНаСервере(Записывать)
	Если Записывать Тогда
		Элементы.ИзмененияРегламентныхЗаданийПрименитьИзменения.Видимость = Ложь;
		Элементы.ИзмененияРегламентныхЗаданийНаименованиеБыло.Гиперссылка = Ложь;
		Элементы.ИзмененияРегламентныхЗаданийНаименованиеБыло.ГиперссылкаЯчейки = Ложь;
		Элементы.ИзмененияРегламентныхЗаданийНаименованиеСтанет.Гиперссылка = Истина;
		Элементы.ИзмененияРегламентныхЗаданийНаименованиеСтанет.ГиперссылкаЯчейки = Истина;
	Иначе
		Элементы.ИзмененияРегламентныхЗаданийЗаполнитьИзменения.КнопкаПоУмолчанию = Ложь;
		Элементы.ИзмененияРегламентныхЗаданийПрименитьИзменения.Видимость = Истина;
		Элементы.ИзмененияРегламентныхЗаданийНаименованиеБыло.Гиперссылка = Истина;
		Элементы.ИзмененияРегламентныхЗаданийНаименованиеБыло.ГиперссылкаЯчейки = Истина;
		Элементы.ИзмененияРегламентныхЗаданийНаименованиеСтанет.Гиперссылка = Ложь;
		Элементы.ИзмененияРегламентныхЗаданийНаименованиеСтанет.ГиперссылкаЯчейки = Ложь;
	КонецЕсли;
	
	ИзмененияРегламентныхЗаданий.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОчередиВыполнения.Ссылка КАК Ссылка,
	|	ОчередиВыполнения.ПометкаУдаления КАК ПометкаУдаления,
	|	ОчередиВыполнения.Операция КАК Операция,
	|	ОчередиВыполнения.Наименование КАК Наименование,
	|	ОчередиВыполнения.ИдентификаторЗадания КАК ИдентификаторЗадания,
	|	ОчередиВыполнения.ИспользованиеЗадания КАК ИспользованиеЗадания,
	|	ОчередиВыполнения.ПредставлениеРасписания КАК ПредставлениеРасписания
	|ИЗ
	|	Справочник.ОчередиВыполнения КАК ОчередиВыполнения
	|ГДЕ
	|	ОчередиВыполнения.Хранилище = ЗНАЧЕНИЕ(Справочник.ХранилищаКонфигураций.ПустаяСсылка)";
	Таблица = Запрос.Выполнить().Выгрузить();
	ЗаполнитьПоПараметрам(Записывать, Таблица, Перечисления.ОперацииОчереди.ВыгрузкаВXML);
	ЗаполнитьПоПараметрам(Записывать, Таблица, Перечисления.ОперацииОчереди.ЗагрузкаВEDT);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПараметрам(Записывать, Таблица, Операция)
	Если Операция = Перечисления.ОперацииОчереди.ВыгрузкаВXML Тогда
		КоличествоОчередей = КоличествоОчередейXML;
	Иначе
		КоличествоОчередей = КоличествоОчередейEDT;
	КонецЕсли;
	
	ОчередиВБазе = Таблица.Скопировать(Новый Структура("Операция", Операция));
	ОчередиВБазе.Сортировать("Наименование");
	
	Если Записывать Тогда
		НадписьБыло = НСтр("ru = 'Было:'");
		НадписьСтанет = НСтр("ru = 'Стало:'");
	Иначе
		НадписьБыло = НСтр("ru = 'Было:'");
		НадписьСтанет = НСтр("ru = 'Станет:'");
	КонецЕсли;
	
	Расписание = РасписаниеПоУмолчанию();
	Расписание.ПериодПовтораВТечениеДня = ЧастотаЗапусков * КоличествоОчередей;
	
	ВсегоЭлементовСправочника = ОчередиВБазе.Количество();
	ОсталосьЭлементовСправочника = ВсегоЭлементовСправочника;
	
	ДлинаНомера = Log10(КоличествоОчередей) + 1;
	ФорматНомера = СтрШаблон("ЧЦ=%1; ЧВН=; ЧГ=", ДлинаНомера);
	Для НомерОчереди = 1 По Макс(КоличествоОчередей, ВсегоЭлементовСправочника) Цикл
		СтрокаРезультат = ИзмененияРегламентныхЗаданий.Добавить();
		СтрокаРезультат.НадписьБыло = НадписьБыло;
		СтрокаРезультат.НадписьСтанет = НадписьСтанет;
		
		Расписание.ВремяНачала = ВремяНачала + (НомерОчереди-1)*ЧастотаЗапусков;
		
		ПометкаУдаленияСтанет = (НомерОчереди > КоличествоОчередей);
		СтрокаРезультат.ИспользованиеЗаданияСтанет = Не ПометкаУдаленияСтанет;
		СтрокаРезультат.ПредставлениеРасписанияСтанет = ?(ПометкаУдаленияСтанет, "", Строка(Расписание));
		СтрокаРезультат.НаименованиеСтанет = СтрШаблон(НСтр("ru = 'Общая - %1 - %2'"), Строка(Операция), Формат(НомерОчереди, ФорматНомера));
		
		ЕстьДанныеСправочника = (ОсталосьЭлементовСправочника > 0);
		Если ЕстьДанныеСправочника Тогда
			ОсталосьЭлементовСправочника = ОсталосьЭлементовСправочника - 1;
			ДанныеСправочника = ОчередиВБазе[НомерОчереди - 1];
			СтрокаРезультат.Ссылка = ДанныеСправочника.Ссылка;
			СтрокаРезультат.НаименованиеБыло = ДанныеСправочника.Наименование;
			СтрокаРезультат.ИспользованиеЗаданияБыло = ДанныеСправочника.ИспользованиеЗадания;
			СтрокаРезультат.ПредставлениеРасписанияБыло = ДанныеСправочника.ПредставлениеРасписания;
			МассивЧтоИзменится = Новый Массив;
			Если СтрокаРезультат.НаименованиеБыло <> СтрокаРезультат.НаименованиеСтанет Тогда
				МассивЧтоИзменится.Добавить(НСтр("ru = 'изменено наименование'"));
			КонецЕсли;
			Если СтрокаРезультат.ИспользованиеЗаданияБыло И Не СтрокаРезультат.ИспользованиеЗаданияСтанет Тогда
				МассивЧтоИзменится.Добавить(НСтр("ru = 'отключено задание'"));
			ИначеЕсли Не СтрокаРезультат.ИспользованиеЗаданияБыло И СтрокаРезультат.ИспользованиеЗаданияСтанет Тогда
				МассивЧтоИзменится.Добавить(НСтр("ru = 'включено задание'"));
			КонецЕсли;
			Если СтрокаРезультат.ПредставлениеРасписанияБыло <> СтрокаРезультат.ПредставлениеРасписанияСтанет Тогда
				МассивЧтоИзменится.Добавить(НСтр("ru = 'изменено расписание'"));
			КонецЕсли;
			Если ДанныеСправочника.ПометкаУдаления И Не ПометкаУдаленияСтанет Тогда
				МассивЧтоИзменится.Добавить(НСтр("ru = 'снята пометка на удаление'"));
			ИначеЕсли Не ДанныеСправочника.ПометкаУдаления И ПометкаУдаленияСтанет Тогда
				МассивЧтоИзменится.Добавить(НСтр("ru = 'установлена пометка на удаление'"));
			КонецЕсли;
			Если МассивЧтоИзменится.Количество() > 0 Тогда
				ЧтоИзменится = СтрСоединить(МассивЧтоИзменится, ", ");
				Если Записывать Тогда
					СтрокаРезультат.ЧтоИзменится = ВРег(Лев(ЧтоИзменится, 1)) + Сред(ЧтоИзменится, 2);
					СправочникОбъект = ДанныеСправочника.Ссылка.ПолучитьОбъект();
					Если СправочникОбъект.ПометкаУдаления <> ПометкаУдаленияСтанет Тогда
						СправочникОбъект.УстановитьПометкуУдаления(ПометкаУдаленияСтанет);
					КонецЕсли;
					СправочникОбъект.Наименование = СтрокаРезультат.НаименованиеСтанет;
					СправочникОбъект.ДополнительныеСвойства.Вставить("Расписание", Расписание);
					СправочникОбъект.ДополнительныеСвойства.Вставить("Использование", СтрокаРезультат.ИспользованиеЗаданияСтанет);
					СправочникОбъект.Записать();
				Иначе
					СтрокаРезультат.ЧтоИзменится = СтрШаблон(НСтр("ru = 'Будет %1'"), ЧтоИзменится);
				КонецЕсли;
			Иначе
				Если Записывать Тогда
					СтрокаРезультат.ЧтоИзменится = НСтр("ru = 'Ничего не изменилось'");
				Иначе
					СтрокаРезультат.ЧтоИзменится = НСтр("ru = 'Ничего не изменится (все ОК)'");
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если Записывать Тогда
				СтрокаРезультат.ЧтоИзменится = НСтр("ru = 'Добавлен новый элемент справочника Очереди'");
				СправочникОбъект = Справочники.ОчередиВыполнения.СоздатьЭлемент();
				СправочникОбъект.Операция = Операция;
				СправочникОбъект.Наименование = СтрокаРезультат.НаименованиеСтанет;
				СправочникОбъект.ДополнительныеСвойства.Вставить("Расписание", Расписание);
				СправочникОбъект.ДополнительныеСвойства.Вставить("Использование", СтрокаРезультат.ИспользованиеЗаданияСтанет);
				СправочникОбъект.Записать();
				СтрокаРезультат.Ссылка = СправочникОбъект.Ссылка;
			Иначе
				СтрокаРезультат.ЧтоИзменится = НСтр("ru = 'Будет добавлен новый элемент справочника Очереди'");
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РасписаниеПоУмолчанию()
	Расписание = Новый РасписаниеРегламентногоЗадания;
	
	// Каждый день.
	Расписание.ПериодПовтораДней = 1;
	
	// Период запуска - с 22:00 до 22:30.
	Расписание.ВремяНачала = ВремяНачала;
	Расписание.ВремяКонца = ВремяЗавершения;
	
	Если Понедельник И Вторник И Среда И Четверг И Пятница И Суббота И Воскресенье Тогда
		// В любой день недели.
	Иначе
		ДниНедели = Новый Массив;
		Если Понедельник Тогда
			ДниНедели.Добавить(1);
		КонецЕсли;
		Если Вторник Тогда
			ДниНедели.Добавить(2);
		КонецЕсли;
		Если Среда Тогда
			ДниНедели.Добавить(3);
		КонецЕсли;
		Если Четверг Тогда
			ДниНедели.Добавить(4);
		КонецЕсли;
		Если Пятница Тогда
			ДниНедели.Добавить(5);
		КонецЕсли;
		Если Суббота Тогда
			ДниНедели.Добавить(6);
		КонецЕсли;
		Если Воскресенье Тогда
			ДниНедели.Добавить(7);
		КонецЕсли;
		Расписание.ДниНедели = ДниНедели;
	КонецЕсли;
	
	Возврат Расписание;
КонецФункции

#КонецОбласти
